Revit 2027 API
AnalysisDisplayMarkersAndTextSettings Constructor
 Constructs a default instance of markers and text settings.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public AnalysisDisplayMarkersAndTextSettings()
Public Sub New
public:
AnalysisDisplayMarkersAndTextSettings()
new : unit -> AnalysisDisplayMarkersAndTextSettings
See Also
Reference
AnalysisDisplayMarkersAndTextSettings Class
AnalysisDisplayMarkersAndTextSettings Overload
Autodesk.Revit.DB.Analysis Namespace